Revit 2027 API
BuiltInFailures.StairRampFailures.InvalidLocationLineJustificationFailure Property
 Modify the location justification to a invalid value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidLocationLineJustificationFailure { get; }
Public Shared ReadOnly Property InvalidLocationLineJustificationFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidLocationLineJustificationFailure {
	FailureDefinitionId^ get ();
}
static member InvalidLocationLineJustificationFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace